Soap_Queries.xml


# Save the Soap Query as filename.xml and Run the Below command
curl -kL  -X POST -H "Content-Type: text/xml; charset=utf-8" --data @cluster.xml https://esxi.fqdn/sdk

 # Retrieve Host Information: 
 <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <RetrieveProperties xmlns="urn:internalvim25">
            <_this xsi:type="ManagedObjectReference" type="PropertyCollector">propertyCollector-123</_this>
            <specSet>
                <propSet>
                    <type>HostSystem</type>
                    <all>true</all>
                    <pathSet>name,hardware</pathSet>
                </propSet>
                <objectSet>
                    <obj xsi:type="ManagedObjectReference" type="HostSystem">host-123</obj>
                </objectSet>
            </specSet>
        </RetrieveProperties>
    </soapenv:Body>
</soapenv:Envelope>



# Get ESXi Version 
<soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><operationID>00000001-00000001</operationID></soap:Header><soap:Body><RetrieveServiceContent xmlns="urn:internalvim25"><_this xsi:type="ManagedObjectReference" type="ServiceInstance">ServiceInstance</_this></RetrieveServiceContent></soap:Body></soap:Envelope>

#List all VMs - Authentication Required
<soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <RetrieveProperties xmlns="urn:internalvim25">
            <_this xsi:type="ManagedObjectReference" type="PropertyCollector">propertyCollector-123</_this>
            <specSet>
                <propSet>
                    <type>VirtualMachine</type>
                    <all>true</all>
                    <pathSet>name,summary</pathSet>
                </propSet>
                <objectSet>
                    <obj xsi:type="ManagedObjectReference" type="Folder">group-d1</obj>
                    <skip>false</skip>
                </objectSet>
            </specSet>
        </RetrieveProperties>
    </soapenv:Body>
</soapenv:Envelope>



# Query Using Username and Password
<soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <Login xmlns="urn:internalvim25">
            <_this xsi:type="SessionManager">SessionManager</_this>
            <userName>YourUsername</userName>
            <password>YourPassword</password>
        </Login>
    </soapenv:Body>
</soapenv:Envelope>


# Retrieve DataStore information - Auth Required 
curl -kL -X POST -H "Content-Type: text/xml" -d '
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <RetrieveProperties xmlns="urn:internalvim25">
            <_this xsi:type="ManagedObjectReference" type="PropertyCollector">propertyCollector-123</_this>
            <specSet>
                <propSet>
                    <type>Datastore</type>
                    <all>true</all>
                    <pathSet>name,capacity,freeSpace</pathSet>
                </propSet>
                <objectSet>
                    <obj xsi:type="ManagedObjectReference" type="Folder">datastore-folder</obj>
                    <skip>false</skip>
                </objectSet>
            </specSet>
        </RetrieveProperties>
    </soapenv:Body>
</soapenv:Envelope>
' https://esxi.fqdn/sdk


# Retreive Cluster Computer Resource   - Auth Required 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <RetrieveProperties xmlns="urn:internalvim25">
            <_this xsi:type="ManagedObjectReference" type="PropertyCollector">propertyCollector-123</_this>
            <specSet>
                <propSet>
                    <type>ClusterComputeResource</type>
                    <all>true</all>
                    <pathSet>name,summary</pathSet>
                </propSet>
                <objectSet>
                    <obj xsi:type="ManagedObjectReference" type="Folder">group-d1</obj>
                    <skip>false</skip>
                </objectSet>
            </specSet>
        </RetrieveProperties>
    </soapenv:Body>
</soapenv:Envelope>


# Retrieve Networking Information - Auth Required 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <RetrieveProperties xmlns="urn:internalvim25">
            <_this xsi:type="ManagedObjectReference" type="PropertyCollector">propertyCollector-123</_this>
            <specSet>
                <propSet>
                    <type>Network</type>
                    <all>true</all>
                    <pathSet>name,summary</pathSet>
                </propSet>
                <objectSet>
                    <obj xsi:type="ManagedObjectReference" type="Folder">network-folder</obj>
                    <skip>false</skip>
                </objectSet>
            </specSet>
        </RetrieveProperties>
    </soapenv:Body>
</soapenv:Envelope>


# Retrieve Resource Pool Information- Auth Required 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <RetrieveProperties xmlns="urn:internalvim25">
            <_this xsi:type="ManagedObjectReference" type="PropertyCollector">propertyCollector-123</_this>
            <specSet>
                <propSet>
                    <type>ResourcePool</type>
                    <all>true</all>
                    <pathSet>name,summary</pathSet>
                </propSet>
                <objectSet>
                    <obj xsi:type="ManagedObjectReference" type="Folder">resource-pool-folder</obj>
                    <skip>false</skip>
                </objectSet>
            </specSet>
        </RetrieveProperties>
    </soapenv:Body>
</soapenv:Envelope>


# Retrieve Alarm Information:
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <RetrieveProperties xmlns="urn:internalvim25">
            <_this xsi:type="ManagedObjectReference" type="PropertyCollector">propertyCollector-123</_this>
            <specSet>
                <propSet>
                    <type>Alarm</type>
                    <all>true</all>
                    <pathSet>name,description</pathSet>
                </propSet>
                <objectSet>
                    <obj xsi:type="ManagedObjectReference" type="Folder">alarm-folder</obj>
                    <skip>false</skip>
                </objectSet>
            </specSet>
        </RetrieveProperties>
    </soapenv:Body>
</soapenv:Envelope>



# Create VM 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:urn="urn:internalvim25">
    <soapenv:Body>
        <CreateVM_Task>
            <_this xsi:type="Folder">vm-folder</_this>
            <name>NewVM</name>
            <config xsi:type="VirtualMachineConfigSpec">
                <!-- VM configuration settings -->
                <name>NewVM</name> <!-- Virtual machine name -->
                <memoryMB>1024</memoryMB> <!-- Memory in MB -->
                <numCPUs>2</numCPUs> <!-- Number of CPUs -->
                <!-- Add other configuration settings as needed -->
            </config>
            <pool xsi:type="ManagedObjectReference" type="ResourcePool">resource-pool-123</pool>
            <host xsi:type="ManagedObjectReference" type="HostSystem">host-123</host>
        </CreateVM_Task>
    </soapenv:Body>
</soapenv:Envelope>


